leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxSmu_regdef.h
/** \brief  Alarm Status Register */
typedef struct _Ifx_SMU_AG_Bits
{
    Ifx_Strict_32Bit SF0:1;                 /**< \brief [0:0] Status flag for alarm 0 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF1:1;                 /**< \brief [1:1] Status flag for alarm 1 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF2:1;                 /**< \brief [2:2] Status flag for alarm 2 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF3:1;                 /**< \brief [3:3] Status flag for alarm 3 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF4:1;                 /**< \brief [4:4] Status flag for alarm 4 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF5:1;                 /**< \brief [5:5] Status flag for alarm 5 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF6:1;                 /**< \brief [6:6] Status flag for alarm 6 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF7:1;                 /**< \brief [7:7] Status flag for alarm 7 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF8:1;                 /**< \brief [8:8] Status flag for alarm 8 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF9:1;                 /**< \brief [9:9] Status flag for alarm 9 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF10:1;                /**< \brief [10:10] Status flag for alarm 10 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF11:1;                /**< \brief [11:11] Status flag for alarm 11 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF12:1;                /**< \brief [12:12] Status flag for alarm 12 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF13:1;                /**< \brief [13:13] Status flag for alarm 13 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF14:1;                /**< \brief [14:14] Status flag for alarm 14 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF15:1;                /**< \brief [15:15] Status flag for alarm 15 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF16:1;                /**< \brief [16:16] Status flag for alarm 16 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF17:1;                /**< \brief [17:17] Status flag for alarm 17 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF18:1;                /**< \brief [18:18] Status flag for alarm 18 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF19:1;                /**< \brief [19:19] Status flag for alarm 19 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF20:1;                /**< \brief [20:20] Status flag for alarm 20 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF21:1;                /**< \brief [21:21] Status flag for alarm 21 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF22:1;                /**< \brief [22:22] Status flag for alarm 22 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF23:1;                /**< \brief [23:23] Status flag for alarm 23 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF24:1;                /**< \brief [24:24] Status flag for alarm 24 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF25:1;                /**< \brief [25:25] Status flag for alarm 25 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF26:1;                /**< \brief [26:26] Status flag for alarm 26 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF27:1;                /**< \brief [27:27] Status flag for alarm 27 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF28:1;                /**< \brief [28:28] Status flag for alarm 28 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF29:1;                /**< \brief [29:29] Status flag for alarm 29 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF30:1;                /**< \brief [30:30] Status flag for alarm 30 belonging to alarm group x (x=0-6). (rwh) */
    Ifx_Strict_32Bit SF31:1;                /**< \brief [31:31] Status flag for alarm 31 belonging to alarm group x (x=0-6). (rwh) */
} Ifx_SMU_AG_Bits;

/** \brief  Alarm Global Configuration */
typedef struct _Ifx_SMU_AGC_Bits
{
    Ifx_Strict_32Bit IGCS0:3;               /**< \brief [2:0] Interrupt Generation Configuration Set 0 (rw) */
    Ifx_Strict_32Bit reserved_3:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IGCS1:3;               /**< \brief [6:4] Interrupt Generation Configuration Set 1 (rw) */
    Ifx_Strict_32Bit reserved_7:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit IGCS2:3;               /**< \brief [10:8] Interrupt Generation Configuration Set 2 (rw) */
    Ifx_Strict_32Bit reserved_11:5;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ICS:3;                 /**< \brief [18:16] Idle Configuration Set (rw) */
    Ifx_Strict_32Bit reserved_19:5;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit PES:5;                 /**< \brief [28:24] Port Emergency Stop (rw) */
    Ifx_Strict_32Bit EFRST:1;               /**< \brief [29:29] Enable FAULT to RUN State Transition (rw) */
    Ifx_Strict_32Bit reserved_30:2;         /**< \brief \internal Reserved */
} Ifx_SMU_AGC_Bits;

/** \brief  Alarm Configuration Register */
typedef struct _Ifx_SMU_AGCF_Bits
{
    Ifx_Strict_32Bit CF0:1;                 /**< \brief [0:0]  (rw) */
    Ifx_Strict_32Bit CF1:1;                 /**< \brief [1:1]  (rw) */
    Ifx_Strict_32Bit CF2:1;                 /**< \brief [2:2]  (rw) */
    Ifx_Strict_32Bit CF3:1;                 /**< \brief [3:3]  (rw) */
    Ifx_Strict_32Bit CF4:1;                 /**< \brief [4:4]  (rw) */
    Ifx_Strict_32Bit CF5:1;                 /**< \brief [5:5]  (rw) */
    Ifx_Strict_32Bit CF6:1;                 /**< \brief [6:6]  (rw) */
    Ifx_Strict_32Bit CF7:1;                 /**< \brief [7:7]  (rw) */
    Ifx_Strict_32Bit CF8:1;                 /**< \brief [8:8]  (rw) */
    Ifx_Strict_32Bit CF9:1;                 /**< \brief [9:9]  (rw) */
    Ifx_Strict_32Bit CF10:1;                /**< \brief [10:10]  (rw) */
    Ifx_Strict_32Bit CF11:1;                /**< \brief [11:11]  (rw) */
    Ifx_Strict_32Bit CF12:1;                /**< \brief [12:12]  (rw) */
    Ifx_Strict_32Bit CF13:1;                /**< \brief [13:13]  (rw) */
    Ifx_Strict_32Bit CF14:1;                /**< \brief [14:14]  (rw) */
    Ifx_Strict_32Bit CF15:1;                /**< \brief [15:15]  (rw) */
    Ifx_Strict_32Bit CF16:1;                /**< \brief [16:16]  (rw) */
    Ifx_Strict_32Bit CF17:1;                /**< \brief [17:17]  (rw) */
    Ifx_Strict_32Bit CF18:1;                /**< \brief [18:18]  (rw) */
    Ifx_Strict_32Bit CF19:1;                /**< \brief [19:19]  (rw) */
    Ifx_Strict_32Bit CF20:1;                /**< \brief [20:20]  (rw) */
    Ifx_Strict_32Bit CF21:1;                /**< \brief [21:21]  (rw) */
    Ifx_Strict_32Bit CF22:1;                /**< \brief [22:22]  (rw) */
    Ifx_Strict_32Bit CF23:1;                /**< \brief [23:23]  (rw) */
    Ifx_Strict_32Bit CF24:1;                /**< \brief [24:24]  (rw) */
    Ifx_Strict_32Bit CF25:1;                /**< \brief [25:25]  (rw) */
    Ifx_Strict_32Bit CF26:1;                /**< \brief [26:26]  (rw) */
    Ifx_Strict_32Bit CF27:1;                /**< \brief [27:27]  (rw) */
    Ifx_Strict_32Bit CF28:1;                /**< \brief [28:28]  (rw) */
    Ifx_Strict_32Bit CF29:1;                /**< \brief [29:29]  (rw) */
    Ifx_Strict_32Bit CF30:1;                /**< \brief [30:30]  (rw) */
    Ifx_Strict_32Bit CF31:1;                /**< \brief [31:31]  (rw) */
} Ifx_SMU_AGCF_Bits;

