leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxSmu_regdef.h
/** \brief  FSP Configuration Register */
typedef struct _Ifx_SMU_AGFSP_Bits
{
    Ifx_Strict_32Bit FE0:1;                 /**< \brief [0:0]  (rw) */
    Ifx_Strict_32Bit FE1:1;                 /**< \brief [1:1]  (rw) */
    Ifx_Strict_32Bit FE2:1;                 /**< \brief [2:2]  (rw) */
    Ifx_Strict_32Bit FE3:1;                 /**< \brief [3:3]  (rw) */
    Ifx_Strict_32Bit FE4:1;                 /**< \brief [4:4]  (rw) */
    Ifx_Strict_32Bit FE5:1;                 /**< \brief [5:5]  (rw) */
    Ifx_Strict_32Bit FE6:1;                 /**< \brief [6:6]  (rw) */
    Ifx_Strict_32Bit FE7:1;                 /**< \brief [7:7]  (rw) */
    Ifx_Strict_32Bit FE8:1;                 /**< \brief [8:8]  (rw) */
    Ifx_Strict_32Bit FE9:1;                 /**< \brief [9:9]  (rw) */
    Ifx_Strict_32Bit FE10:1;                /**< \brief [10:10]  (rw) */
    Ifx_Strict_32Bit FE11:1;                /**< \brief [11:11]  (rw) */
    Ifx_Strict_32Bit FE12:1;                /**< \brief [12:12]  (rw) */
    Ifx_Strict_32Bit FE13:1;                /**< \brief [13:13]  (rw) */
    Ifx_Strict_32Bit FE14:1;                /**< \brief [14:14]  (rw) */
    Ifx_Strict_32Bit FE15:1;                /**< \brief [15:15]  (rw) */
    Ifx_Strict_32Bit FE16:1;                /**< \brief [16:16]  (rw) */
    Ifx_Strict_32Bit FE17:1;                /**< \brief [17:17]  (rw) */
    Ifx_Strict_32Bit FE18:1;                /**< \brief [18:18]  (rw) */
    Ifx_Strict_32Bit FE19:1;                /**< \brief [19:19]  (rw) */
    Ifx_Strict_32Bit FE20:1;                /**< \brief [20:20]  (rw) */
    Ifx_Strict_32Bit FE21:1;                /**< \brief [21:21]  (rw) */
    Ifx_Strict_32Bit FE22:1;                /**< \brief [22:22]  (rw) */
    Ifx_Strict_32Bit FE23:1;                /**< \brief [23:23]  (rw) */
    Ifx_Strict_32Bit FE24:1;                /**< \brief [24:24]  (rw) */
    Ifx_Strict_32Bit FE25:1;                /**< \brief [25:25]  (rw) */
    Ifx_Strict_32Bit FE26:1;                /**< \brief [26:26]  (rw) */
    Ifx_Strict_32Bit FE27:1;                /**< \brief [27:27]  (rw) */
    Ifx_Strict_32Bit FE28:1;                /**< \brief [28:28]  (rw) */
    Ifx_Strict_32Bit FE29:1;                /**< \brief [29:29]  (rw) */
    Ifx_Strict_32Bit FE30:1;                /**< \brief [30:30]  (rw) */
    Ifx_Strict_32Bit FE31:1;                /**< \brief [31:31]  (rw) */
} Ifx_SMU_AGFSP_Bits;

/** \brief  Clock Control Register */
typedef struct _Ifx_SMU_CLC_Bits
{
    Ifx_Strict_32Bit DISR:1;                /**< \brief [0:0] Module Disable Request Bit (rw) */
    Ifx_Strict_32Bit DISS:1;                /**< \brief [1:1] Module Disable Status Bit (rh) */
    Ifx_Strict_32Bit FDIS:1;                /**< \brief [2:2] Force Disable (rw) */
    Ifx_Strict_32Bit EDIS:1;                /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_SMU_CLC_Bits;

/** \brief  Command Register */
typedef struct _Ifx_SMU_CMD_Bits
{
    Ifx_Strict_32Bit CMD:4;                 /**< \brief [3:0] Implements the SMU Command Interface. (w) */
    Ifx_Strict_32Bit ARG:4;                 /**< \brief [7:4] Implements the SMU Command Interface. (w) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_SMU_CMD_Bits;

/** \brief  Debug Register */
typedef struct _Ifx_SMU_DBG_Bits
{
    Ifx_Strict_32Bit SSM:2;                 /**< \brief [1:0] Running state of the SMU State Machine (rh) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_SMU_DBG_Bits;

/** \brief  Fault Signaling Protocol */
typedef struct _Ifx_SMU_FSP_Bits
{
    Ifx_Strict_32Bit PRE1:3;                /**< \brief [2:0] Prescaler1 (rw) */
    Ifx_Strict_32Bit PRE2:2;                /**< \brief [4:3] Prescaler2 (rw) */
    Ifx_Strict_32Bit MODE:2;                /**< \brief [6:5] Fault Signaling Protocol configuration (rw) */
    Ifx_Strict_32Bit PES:1;                 /**< \brief [7:7] Port Emergency Stop (PES) (rw) */
    Ifx_Strict_32Bit TFSP_LOW:14;           /**< \brief [21:8] Specification of the FSP fault state duration (r) */
    Ifx_Strict_32Bit TFSP_HIGH:10;          /**< \brief [31:22] Specification the FSP fault state duration (rw) */
} Ifx_SMU_FSP_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_SMU_ID_Bits
{
    Ifx_Strict_32Bit MODREV:8;              /**< \brief [7:0] Module Revision Number (r) */
    Ifx_Strict_32Bit MODTYPE:8;             /**< \brief [15:8] Module Type (r) */
    Ifx_Strict_32Bit MODNUMBER:16;          /**< \brief [31:16] Module Number Value (r) */
} Ifx_SMU_ID_Bits;

/** \brief  Key Register */
typedef struct _Ifx_SMU_KEYS_Bits
{
    Ifx_Strict_32Bit CFGLCK:8;              /**< \brief [7:0] Configuration Lock (rw) */
    Ifx_Strict_32Bit PERLCK:8;              /**< \brief [15:8] Permanent Lock (rw) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_SMU_KEYS_Bits;

/** \brief  SMU Reset Register 0 */
typedef struct _Ifx_SMU_KRST0_Bits
{
    Ifx_Strict_32Bit RST:1;                 /**< \brief [0:0] Kernel Reset (rwh) */
    Ifx_Strict_32Bit RSTSTAT:1;             /**< \brief [1:1] Kernel Reset Status (rh) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_SMU_KRST0_Bits;

/** \brief  SMU Reset Register 1 */
typedef struct _Ifx_SMU_KRST1_Bits
{
    Ifx_Strict_32Bit RST:1;                 /**< \brief [0:0] Kernel Reset (rwh) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_SMU_KRST1_Bits;

/** \brief  SMU Reset Status Clear Register */
typedef struct _Ifx_SMU_KRSTCLR_Bits
{
    Ifx_Strict_32Bit CLR:1;                 /**< \brief [0:0] Kernel Reset Status Clear (w) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_SMU_KRSTCLR_Bits;

/** \brief  OCDS Control and Status */
typedef struct _Ifx_SMU_OCS_Bits
{
    Ifx_Strict_32Bit TGS:2;                 /**< \brief [1:0] Trigger Set for OTGB0/1 (rw) */
    Ifx_Strict_32Bit TGB:1;                 /**< \brief [2:2] OTGB0/1 Bus Select (rw) */
    Ifx_Strict_32Bit TG_P:1;                /**< \brief [3:3] TGS, TGB Write Protection (w) */
    Ifx_Strict_32Bit reserved_4:20;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SUS:4;                 /**< \brief [27:24] OCDS Suspend Control (rw) */
    Ifx_Strict_32Bit SUS_P:1;               /**< \brief [28:28] SUS Write Protection (w) */
    Ifx_Strict_32Bit SUSSTA:1;              /**< \brief [29:29] Suspend State (rh) */
    Ifx_Strict_32Bit reserved_30:2;         /**< \brief \internal Reserved */
} Ifx_SMU_OCS_Bits;

/** \brief  Port Control */
typedef struct _Ifx_SMU_PCTL_Bits
{
    Ifx_Strict_32Bit HWDIR:1;               /**< \brief [0:0] Port Direction. (rw) */
    Ifx_Strict_32Bit HWEN:1;                /**< \brief [1:1] Port Enable. (rw) */
    Ifx_Strict_32Bit reserved_2:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit PCS:1;                 /**< \brief [7:7] PAD Configuration Select (rw) */
    Ifx_Strict_32Bit reserved_8:8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit PCFG:16;               /**< \brief [31:16] PAD Configuration (rh) */
} Ifx_SMU_PCTL_Bits;

/** \brief  Register Monitor Control */
typedef struct _Ifx_SMU_RMCTL_Bits
{
    Ifx_Strict_32Bit TE:1;                  /**< \brief [0:0] Test Enable. (rw) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_SMU_RMCTL_Bits;

/** \brief  Register Monitor Error Flags */
typedef struct _Ifx_SMU_RMEF_Bits
{
    Ifx_Strict_32Bit EF0:1;                 /**< \brief [0:0] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF1:1;                 /**< \brief [1:1] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF2:1;                 /**< \brief [2:2] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF3:1;                 /**< \brief [3:3] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF4:1;                 /**< \brief [4:4] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF5:1;                 /**< \brief [5:5] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF6:1;                 /**< \brief [6:6] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF7:1;                 /**< \brief [7:7] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF8:1;                 /**< \brief [8:8] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF9:1;                 /**< \brief [9:9] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF10:1;                /**< \brief [10:10] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF11:1;                /**< \brief [11:11] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF12:1;                /**< \brief [12:12] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF13:1;                /**< \brief [13:13] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF14:1;                /**< \brief [14:14] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF15:1;                /**< \brief [15:15] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF16:1;                /**< \brief [16:16] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF17:1;                /**< \brief [17:17] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF18:1;                /**< \brief [18:18] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF19:1;                /**< \brief [19:19] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF20:1;                /**< \brief [20:20] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF21:1;                /**< \brief [21:21] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF22:1;                /**< \brief [22:22] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF23:1;                /**< \brief [23:23] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF24:1;                /**< \brief [24:24] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF25:1;                /**< \brief [25:25] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF26:1;                /**< \brief [26:26] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF27:1;                /**< \brief [27:27] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF28:1;                /**< \brief [28:28] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF29:1;                /**< \brief [29:29] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF30:1;                /**< \brief [30:30] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit EF31:1;                /**< \brief [31:31] Status flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
} Ifx_SMU_RMEF_Bits;

/** \brief  Register Monitor Self Test Status */
typedef struct _Ifx_SMU_RMSTS_Bits
{
    Ifx_Strict_32Bit STS0:1;                /**< \brief [0:0] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS1:1;                /**< \brief [1:1] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS2:1;                /**< \brief [2:2] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS3:1;                /**< \brief [3:3] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS4:1;                /**< \brief [4:4] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS5:1;                /**< \brief [5:5] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS6:1;                /**< \brief [6:6] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS7:1;                /**< \brief [7:7] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS8:1;                /**< \brief [8:8] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS9:1;                /**< \brief [9:9] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS10:1;               /**< \brief [10:10] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS11:1;               /**< \brief [11:11] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS12:1;               /**< \brief [12:12] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS13:1;               /**< \brief [13:13] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS14:1;               /**< \brief [14:14] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS15:1;               /**< \brief [15:15] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS16:1;               /**< \brief [16:16] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS17:1;               /**< \brief [17:17] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS18:1;               /**< \brief [18:18] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS19:1;               /**< \brief [19:19] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS20:1;               /**< \brief [20:20] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS21:1;               /**< \brief [21:21] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS22:1;               /**< \brief [22:22] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS23:1;               /**< \brief [23:23] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS24:1;               /**< \brief [24:24] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS25:1;               /**< \brief [25:25] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS26:1;               /**< \brief [26:26] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS27:1;               /**< \brief [27:27] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS28:1;               /**< \brief [28:28] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS29:1;               /**< \brief [29:29] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS30:1;               /**< \brief [30:30] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
    Ifx_Strict_32Bit STS31:1;               /**< \brief [31:31] Ready flag related to the different instances of the Safety Flip-Flop safety mechanism. (rwh) */
} Ifx_SMU_RMSTS_Bits;

